ATsupportum/src/Catalogs/ВидыДоговоров_ат/ВидыДоговоров_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДоговоров_ат</name>
  <attributes>
    <name>ПериодДанныхДляОпределенияТарифногоПлана</name>
    <type>
      <types>EnumRef.ПериодДанныхДляОпределенияТарифногоПлана_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРеализаций</name>
    <type>
      <types>EnumRef.ПериодичностиРеализаций_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСчетов</name>
    <type>
      <types>EnumRef.ПериодичностиСчетов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостфиксНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплатыВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>EnumRef.ТипыДоговоров_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчетаТарифногоПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура_ат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ATsupportum/src/Catalogs/ВидыДоговоров_ат/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправляемыеФормы_Сервер_ат.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправляемыеФормы_Клиент_ат.ПриОткрытии(ЭтаФорма, Отказ);
	
	УстановитьПодсказкуВводаПолейОпределенияТарифногоПлана();
	
КонецПроцедуры

#КонецОбласти 

#Область УниверсальныеОбработчикиДействий

&НаКлиенте
Процедура ОбработчикУниверсальныхДействий(Команда)
	
	УправляемыеФормы_Клиент_ат.ДополнительныеДействияФормы(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаСервере
Функция   ОбработчикУниверсальныхДействий_Сервер(Элемент) Экспорт
	
	Возврат УправляемыеФормы_Сервер_ат.ДополнительныеДействияФормы(ЭтаФорма, Команды[Элемент.Имя]);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	Если ПустаяСтрока(Объект.Наименование) Или 
		(Не Объект.Ссылка.Пустая() И Объект.Ссылка.Наименование = Строка(Объект.Ссылка.ТипДоговора)) Тогда
		
		Объект.Наименование = Строка(Объект.ТипДоговора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкуВводаПолейОпределенияТарифногоПлана()
	
	ФормулаРасчетаТарифногоПланаПоУмолчанию = Константы.ФормулаРасчетаТарифногоПланаПоУмолчанию_ат.Получить();
	Если ПустаяСтрока(ФормулаРасчетаТарифногоПланаПоУмолчанию) Тогда
		Элементы.ФормулаРасчетаТарифногоПлана.ПодсказкаВвода = "По умолчанию (Значение = 0)";
	Иначе
		Элементы.ФормулаРасчетаТарифногоПлана.ПодсказкаВвода = ФормулаРасчетаТарифногоПланаПоУмолчанию;
	КонецЕсли;
	
	ПериодДанныхДляОпределенияТарифногоПланаПоУмолчанию = Константы.ПериодДанныхДляОпределенияТарифногоПланаПоУмолчанию_ат.Получить();
	Если ПериодДанныхДляОпределенияТарифногоПланаПоУмолчанию = Неопределено Тогда
		Элементы.ПериодДанныхДляОпределенияТарифногоПлана.ПодсказкаВвода = "По умолчанию (За предыдущий месяц)";
	Иначе
		Элементы.ПериодДанныхДляОпределенияТарифногоПлана.ПодсказкаВвода = Строка(ПериодДанныхДляОпределенияТарифногоПланаПоУмолчанию);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиДействийПользователя

&НаКлиенте
Процедура ТипДоговораПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти
